<a href="https://colab.research.google.com/github/jwross24/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-10-03 14:11:04--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.0.195
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.0.195|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  34.6MB/s    in 6.1s

2019-10-03 14:11:11 (32.0 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [0]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [0]:
%cd instacart_2017_05_01

[Errno 2] No such file or directory: 'instacart_2017_05_01'
/content/instacart_2017_05_01

In [0]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

### Write down which columns you need and which dataframes have them.

We need the columns `order_id` and `product_name`.

For `order_id`, we can find it in
- order_products__prior
- order_products__train

For `product_name`, we can find it in
- products

Since we can't find a dataframe in common between these two, we need to use `product_id` as an intermediate, which we can find in both products and order_products__prior/train.

### Merge these into a single dataframe.

In [0]:
import pandas as pd

In [0]:
##### YOUR CODE HERE #####
# Load the data that we need
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__train = pd.read_csv('order_products__train.csv')
# orders = pd.read_csv('orders.csv')
products = pd.read_csv('products.csv')

In [0]:
# Concatenate the two order_products dataframes
order_products__train.shape

(1384617, 4)

In [0]:
order_products__prior.shape

(32434489, 4)

In [0]:
order_products = pd.concat([order_products__prior, order_products__train])

print(order_products.shape)
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
# Get a subset of the products (top 10 given)
top_10 = ['Banana', 'Bag of Organic Bananas', 'Organic Strawberries',
          'Organic Baby Spinach', 'Organic Hass Avocado', 'Organic Avocado',
          'Large Lemon', 'Strawberries', 'Limes', 'Organic Whole Milk']

condition = products['product_name'].isin(top_10)
columns = ['product_id', 'product_name']

products_subset = products.loc[condition, columns]

print(products_subset.shape)
products_subset.head()

(10, 2)

       product_id            product_name
13175       13176  Bag of Organic Bananas
16796       16797            Strawberries
21136       21137    Organic Strawberries
21902       21903    Organic Baby Spinach
24851       24852                  Banana

In [0]:
order_products_subset = order_products[['order_id', 'product_id']]
order_products_subset.head(20)

    order_id  product_id
0          2       33120
1          2       28985
2          2        9327
3          2       45918
4          2       30035
5          2       17794
6          2       40141
7          2        1819
8          2       43668
9          3       33754
10         3       24838
11         3       17704
12         3       21903
13         3       17668
14         3       46667
15         3       17461
16         3       32665
17         4       46842
18         4       26434
19         4       39758

In [0]:
# Merge order_products_subset and products_subset
merged = pd.merge(order_products_subset, products_subset,
                  how='inner', on='product_id')

merged.head()

   order_id  product_id          product_name
0         3       21903  Organic Baby Spinach
1        26       21903  Organic Baby Spinach
2        31       21903  Organic Baby Spinach
3        39       21903  Organic Baby Spinach
4        56       21903  Organic Baby Spinach

In [0]:
merged['product_name'].value_counts()

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

### Complete the code cells we skipped near the beginning

In [0]:
%matplotlib inline
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

In [0]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [0]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

### Replicate the lesson code

In [0]:
table1.columns.tolist()

['treatmenta', 'treatmentb']

In [0]:
table1.index.tolist()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [0]:
table1 = table1.reset_index()

In [0]:
tidy = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [0]:
tidy = tidy.rename(columns={
    'index': 'name',
    'variable': 'trt',
    'value': 'result'
})
tidy

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [0]:
tidy.trt = tidy.trt.str.replace('treatment', '')
tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [0]:
wide = tidy.pivot_table(index='name', columns='trt', values='result')
wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

### Table 2 --> Tidy

In [0]:
table2.columns.tolist()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [0]:
table2.index.tolist()

['treatmenta', 'treatmentb']

In [0]:
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [0]:
tidy = table2.melt(id_vars='index',
                   value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [0]:
tidy = tidy.rename(columns={
    'index': 'trt',
    'variable': 'name',
    'value': 'result'
})
tidy

          trt          name  result
0  treatmenta    John Smith     NaN
1  treatmentb    John Smith     2.0
2  treatmenta      Jane Doe    16.0
3  treatmentb      Jane Doe    11.0
4  treatmenta  Mary Johnson     3.0
5  treatmentb  Mary Johnson     1.0

In [0]:
tidy.trt = tidy.trt.str.replace('treatment', '')
tidy

  trt          name  result
0   a    John Smith     NaN
1   b    John Smith     2.0
2   a      Jane Doe    16.0
3   b      Jane Doe    11.0
4   a  Mary Johnson     3.0
5   b  Mary Johnson     1.0

### Tidy --> Table 2

In [0]:
wide = tidy.pivot_table(index='trt', columns='name', values='result')
wide

name  Jane Doe  John Smith  Mary Johnson
trt
a         16.0         NaN           3.0
b         11.0         2.0           1.0

### Flights pivot table

In [0]:
flights = sns.load_dataset('flights')

flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [0]:
flights_pivot = flights.pivot_table(index='year', columns='month',
                                    values='passengers')
flights_pivot

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####
# Load the data that we need
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__train = pd.read_csv('order_products__train.csv')
orders = pd.read_csv('orders.csv')
products = pd.read_csv('products.csv')

In [0]:
# Concatenate the order_products dataframes
order_products = pd.concat([order_products__prior, order_products__train])

print(order_products.shape)
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
# Create subsets of the data with only the columns we need
columns = ['order_id', 'product_id']
order_products = order_products[columns]

columns = ['order_id', 'order_hour_of_day']
orders = orders[columns]

columns = ['product_id', 'product_name']
products = products[columns]

In [0]:
# Merge the dataframes together into one
merged = (products.merge(orders.merge(order_products)))

merged.head()

   product_id                product_name  order_id  order_hour_of_day
0           1  Chocolate Sandwich Cookies   3139998                 11
1           1  Chocolate Sandwich Cookies   1977647                 17
2           1  Chocolate Sandwich Cookies    389851                 21
3           1  Chocolate Sandwich Cookies     63770                  6
4           1  Chocolate Sandwich Cookies    652770                 13

In [0]:
# Create a subset dataframe of only the popular (>2900 orders) items
counts = merged['product_name'].value_counts()
print(counts[counts > 2900].index)

Index(['Banana', 'Bag of Organic Bananas', 'Organic Strawberries',
       'Organic Baby Spinach', 'Organic Hass Avocado', 'Organic Avocado',
       'Large Lemon', 'Strawberries', 'Limes', 'Organic Whole Milk',
       ...
       'Oh My Yog! Pacific Coast Strawberry Trilayer Yogurt',
       'Lemon Cayenne Agave Cold Pressed Juice Beverage', 'Chives',
       'Stage 2 Sweet Potato Corn & Apple Baby Food',
       'Organic Free Range Grade A Large Brown Eggs',
       'Creamy Deluxe Macaroni Dinner Elbows & Four Cheese Sauce',
       'Organic Spelt Tortillas', 'Stage 1 - Just Prunes', 'Whole Chia Seeds',
       '3 lb Clementines'],
      dtype='object', length=2051)

In [0]:
merged[merged['product_name'].isin(counts[counts > 2900].index)]

          product_id          product_name  order_id  order_hour_of_day
12081             34  Peanut Butter Cereal   3331846                 16
12082             34  Peanut Butter Cereal   1385910                 17
12083             34  Peanut Butter Cereal   2661186                 19
12084             34  Peanut Butter Cereal   3374094                 16
12085             34  Peanut Butter Cereal   1007973                 14
12086             34  Peanut Butter Cereal    239906                 10
12087             34  Peanut Butter Cereal   1802947                  0
12088             34  Peanut Butter Cereal    670138                 23
12089             34  Peanut Butter Cereal   1585137                  1
12090             34  Peanut Butter Cereal    937113                 22
12091             34  Peanut Butter Cereal    502391                 19
12092             34  Peanut Butter Cereal   1206128                 11
12093             34  Peanut Butter Cereal   2894072                 10
12094             34  Peanut Butter Cereal   1957089                 16
12095             34  Peanut Butter Cereal   1048797                 18
12096             34  Peanut Butter Cereal   1056167                 12
12097             34  Peanut Butter Cereal    735300                 21
12098             34  Peanut Butter Cereal   3206736                 18
12099             34  Peanut Butter Cereal   3068717                 18
12100             34  Peanut Butter Cereal   2006429                 19
12101             34  Peanut Butter Cereal   2063720                 10
12102             34  Peanut Butter Cereal   2674584                 17
12103             34  Peanut Butter Cereal   3106604                 20
12104             34  Peanut Butter Cereal   1793808                 10
12105             34  Peanut Butter Cereal   3087100                 11
12106             34  Peanut Butter Cereal   3217462                 20
12107             34  Peanut Butter Cereal   1643833                 19
12108             34  Peanut Butter Cereal    870490                 18
12109             34  Peanut Butter Cereal   2600209                 10
12110             34  Peanut Butter Cereal    269701                 19
...              ...                   ...       ...                ...
33818784       49683        Cucumber Kirby   2478198                 15
33818785       49683        Cucumber Kirby   3410055                  2
33818786       49683        Cucumber Kirby   1839804                 16
33818787       49683        Cucumber Kirby   2612962                 15
33818788       49683        Cucumber Kirby   2262542                 13
33818789       49683        Cucumber Kirby   1013729                 11
33818790       49683        Cucumber Kirby   2652035                 12
33818791       49683        Cucumber Kirby   1600159                 12
33818792       49683        Cucumber Kirby   2472959                 16
33818793       49683        Cucumber Kirby    587902                 11
33818794       49683        Cucumber Kirby   2473611                 21
33818795       49683        Cucumber Kirby    677664                 12
33818796       49683        Cucumber Kirby   3205604                 14
33818797       49683        Cucumber Kirby   1076978                 14
33818798       49683        Cucumber Kirby    128150                 13
33818799       49683        Cucumber Kirby   2083902                 18
33818800       49683        Cucumber Kirby   1556037                  9
33818801       49683        Cucumber Kirby   1024534                 17
33818802       49683        Cucumber Kirby   1643084                  8
33818803       49683        Cucumber Kirby    685589                 14
33818804       49683        Cucumber Kirby     70216                  9
33818805       49683        Cucumber Kirby   2547462                 23
33818806       49683        Cucumber Kirby   2752192                  9
33818807       49683        Cucumber Kirby    584166                  7
33818808       49683        Cucumber Kirby    675592                 16
33818809       49683        Cucumber Kirby   1251580                  8
33818810       49683        Cucumber Kirby    438707                 20
33818811       49683        Cucumber Kirby     36819                 11
33818812       49683        Cucumber Kirby    147354                 19
33818813       49683        Cucumber Kirby   1764570                  0

[22450886 rows x 4 columns]

In [0]:
merged_popular = merged[merged['product_name'].isin(counts[counts > 2900].index)]
popular_products = merged_popular['product_name'].unique()
popular_products

array(['Peanut Butter Cereal', 'European Cucumber',
       'Wild Albacore Tuna No Salt Added', ..., 'Challah Bread',
       'Yoghurt Blueberry', 'Cucumber Kirby'], dtype=object)

In [0]:
popular_means = merged_popular.groupby('product_name')[['order_hour_of_day']].mean()

popular_means.head()

                          order_hour_of_day
product_name
0% Fat Free Organic Milk          13.233899
0% Greek Strained Yogurt          12.298806
1 Liter                           13.696120
1% Low Fat Milk                   13.377029
1% Lowfat Milk                    13.285121

In [0]:
popular_means.sort_values(by=['order_hour_of_day'], ascending=False).head(25)

                                              order_hour_of_day
product_name
Half Baked Frozen Yogurt                              14.526986
The Tonight Dough™ Ice Cream                          14.526299
Americone Dream® Ice Cream                            14.394912
Half Baked® Ice Cream                                 14.388942
Phish Food® Ice Cream                                 14.373308
Milk and Cookies Ice Cream                            14.369711
Sicilian Pistachio                                    14.306421
Chocolate Peanut Butter Cup Gelato                    14.303480
Birthday Cake Light Ice Cream                         14.292018
Cherry Garcia Ice Cream                               14.270300
Strawberry Ice Cream                                  14.268841
Vanilla Bean Light Ice Cream                          14.257849
Coffee Ice Cream                                      14.256280
Roman Raspberry Sorbetto                              14.248191
Mediterranean Mint Gelato                             14.233542
Caramel Cookie Crunch Gelato                          14.224069
Chocolate Chip Cookie Dough Ice Cream                 14.204325
Mint Chip                                             14.189235
Coconut Almond Minis Frozen Dessert Bars              14.156069
Mint Chocolate Chip Ice Cream                         14.134992
Chocolate Peanut Butter Ice Cream                     14.120449
Vanilla Milk Chocolate Almond Ice Cream Bars          14.104662
Sea Salt Caramel Gelato                               14.083895
Vanilla Bean Ice Cream                                14.039406
Rising Crust Pepperoni Pizza                          14.027699

In [0]:
popular_means.sort_values(by=['order_hour_of_day']).head(25)

                                                    order_hour_of_day
product_name
Half And Half Ultra Pasteurized                             11.767279
Sweet & Salty Nut Granola Bars Peanut                       11.898340
Pub Mix                                                     12.004019
Nutri Grain Bars Multi Pack                                 12.049459
Trail Mix                                                   12.059043
Original Rice Krispies Treats                               12.114576
Apples                                                      12.123962
Cheez-It Baked Snack Crackers                               12.140281
Dry Roasted Almonds                                         12.151995
Zero Calorie Cola                                           12.168894
Crunchy Oats 'n Honey Granola Bars                          12.188945
Original Beef Jerky                                         12.270420
Cheez-It Cheddar Cracker                                    12.271951
Popcorn                                                     12.275556
Milk Chocolate Almonds                                      12.288367
0% Greek Strained Yogurt                                    12.298806
Extra Fancy Unsalted Mixed Nuts                             12.315155
Pink Lady Apples                                            12.330913
with Crispy Almonds Cereal                                  12.348542
Original Almondmilk                                         12.353126
Clementines                                                 12.368174
Half And Half Cream                                         12.374539
French Vanilla Coffee Creamer                               12.377249
Orange & Lemon Flavor Variety Pack Sparkling Fr...          12.395354
Cinnamon Brown Sugar Breakfast Biscuits                     12.409215

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####